web/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "todos" ("text", "isCompleted", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Pupa"], ["isCompleted", false], ["project_id", 2], ["created_at", "2019-04-18 02:45:10.132748"], ["updated_at", "2019-04-18 02:45:10.132748"]]
---
  def index
	@projects = Project.all
	@project = Project.new

	if params[:project_id] != nil
		@project = Project.find(params[:project_id])
    @project.todos.create({"text": params[:todo_text], "isCompleted": false})