app/controllers/projects_json_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
        render json: Project.all