app/controllers/todos_controller.rb

	def update
		@project = Project.find(params[:project_id])
		@todo = @project.todos.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 2]]