app/controllers/todos_controller.rb

	def update
	  @project = Project.find(params[:project_id])
	  @todo = @project.todos[params[:id].to_i - 1]
	  if @todo.isCompleted
		@todo.isCompleted = false
	  else
		@todo.isCompleted = true
	  end
	  @todo.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "isCompleted" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["isCompleted", true], ["updated_at", "2019-04-17 20:29:24.730341"], ["id", 8]]